{"basics":{"name":"Henrik Becker","label":"Software Engineer","website":"http://www.henrikbecker.net","summary":"Full stack developer dedicated to building robust, maintainable and testable systems.\nA practitioner of Test Driven Development and agile processes.\nAn expert in .Net development using C#.\nMSCD Web Applications.\nSelf-educated with 18 years of working experience.\nEfficient and a fast learner.","location":{"region":"Stockholm","countryCode":null},"profiles":[{"network":"LinkedIn","url":"https://www.linkedin.com/prettygoodprogrammer"},{"network":"Facebook","url":"https://www.facebook.com/thehenrikbecker"},{"network":"MySpace","url":"https://myspace.com/henrik.becker"},{"network":"Wordpress","url":"https://vacationbyexample.wordpress.com/"}]},"skills":[{"name":"Languages","keywords":["C#","JavaScript","HTML","CSS","VB.Net","T-SQL","XML","XSLT"]},{"name":"Frameworks","keywords":["Asp.Net MVC","Asp.Net Web Api","Asp.Net Web Forms","jQuery","KnockoutJS","WCF"]},{"name":"Methods","keywords":["Test Driven Development","Specification by Example","Continuous Integration","Scrum"]},{"name":"Tools","keywords":["Visual Studio","Git","ReSharper","TeamCity","Octopus Deploy"]},{"name":"Databases","keywords":["SQL Server","MySql","Oracle"]}],"languages":[{"name":"Swedish","keywords":"Native"},{"name":"English","keywords":"Fluent (IELTS overall score 8.5)"}],"interests":[{"name":{"name":"Music"}},{"name":{"name":"Playing Guitar"}},{"name":{"name":"Motorcycling"}},{"name":{"name":"Australia"}},{"name":{"name":"Sicily"}},{"name":{"name":"Good food"}},{"name":{"name":"Reading"}},{"name":{"name":"Beer"}},{"name":{"name":"Travelling","url":"http://vacationbyexample.wordpress.com"}}],"education":[{"institution":"KomVux Lidingö","area":"Municipal adult education","startDate":"1995-01-01","endDate":"1997-01-01"},{"institution":"Kulturama","area":"Music","startDate":"1992-01-01","endDate":"1993-01-01"}],"work":[{"name":"Plejmo","position":"","website":"","startDate":"2014-11-03","endDate":"2017-07-05","summary":"Back- and front end development of a Video On Demand (VOD) service based on Asp.Net MVC and EpiServer. DevOps tasks including configuring web sites, configuring automated builds and setting up automated deployment.\n","higlights":["Increased system performance by refactoring the system to the CQRS pattern with a denormalized, read optimized database for querying.","Increased stability and scalability by creating Micro Services for third party integration.","Reduced errors during deployment by implementing automated deployment.","Increased code quality by introducing automated acceptance tests and living documentation."]},{"name":"Arbetsförmedlingen","position":"","website":"","startDate":"2014-06-24","endDate":"2014-09-26","summary":"Maintenance of a legacy solution for managing requisitions at Sweden's public employment services.","higlights":null},{"name":"Qbranch Competence Manager","position":"","website":"","startDate":"2014-04-28","endDate":"2014-06-23","summary":"","higlights":null},{"name":"Wasa Kredit","position":"","website":"","startDate":"2012-03-12","endDate":"2013-11-14","summary":"Employed as Lead Developer.","higlights":["Reduced complexity and system decay through refactoring and the application of common software architecture patterns.","Guided the development teams towards an iterative approach to software development with the product owner, functional analysts, testers and developers working closely together during the entire development cycle.","Introduced the idea of living documentation in the form of executable specifications."]},{"name":"Cale Access AB","position":"","website":"","startDate":"2011-09-01","endDate":"2012-03-09","summary":"Cale is one of the world's leading manufacturers of parking meters.  Henrik was involved in the project \"Historical Changes\" aiming to facilitate historical changes in \"TrueUp\".  TrueUp is a set of financial rules for economical compensation between the city of Chigago and the company Chicago Parking Meters.  The TrueUp system automates the compensation calculations and is a part of Cale Web Office 2.  Challenges: Complex domain model. Complex business rules. Massive data sets\n","higlights":null},{"name":"CashGuard","position":"","website":"","startDate":"2011-06-01","endDate":"2011-09-01","summary":"CashGuard specialises in cash management solutions for the retail industry. The software StoreManager is a solution for monitoring of CashGuard systems. Henrik was the key person in the introduction of behavior driven development (Specification by Example)  by taking traditional user stories in Word format and turning them into executable specifications.\n","higlights":["Was the key person in introducing behavior driven development.","Lay the foundation for automated regression tests and living documentation by taking existing user stories and turning them into executable specifications using SpecFlow."]},{"name":"Länsförsäkringar","position":"","website":"","startDate":"2009-09-01","endDate":"2011-05-01","summary":"Worked with the development of a WCF based payment platform adding support for automatic payment services and prompts. Quality assurance and performance optimization of connecting systems.","higlights":["Was instrumental in the migration of the payment platform's database from Oracle to SQL Server."]},{"name":"Tradera","position":"","website":"","startDate":"2009-08-01","endDate":"2009-08-31","summary":"Participated in the development of a sales support system for managing articles and campaigns published on tradera.se.\n","higlights":null},{"name":"Astando","position":"","website":"","startDate":"2008-02-28","endDate":"2009-05-01","summary":"Astando is one of the leading companies in the GIS area and in the forefront of the Local Roaddatabase concept (LV).  LV is the foundation on top of which applications concerning the road network, traffic and road-users are built.  The assignment involved development of a client/server application for importing and presenting traffic measurement data for Stockholm and Gothenburg.","higlights":null},{"name":"hitta.se","position":"","website":"","startDate":"2006-03-01","endDate":"2008-02-28","summary":"Hitta.se is a Swedish search engine that offers telephone directory, addresses and maps. It has been one of Sweden's 10 most popular sites for quite some time, I worked with hitta.se's internal order system and improved the public map site with services such as weather and traffic information.\n","higlights":["Was a key person in the development of hitta.se - one of Swedens top 10 most popular sites.","Created the services hitta.se/trafiknytt (traffic information) and hitta.se/vader (weather information)."]},{"name":"ICA Banken AB","position":"","website":"","startDate":"2006-03-01","endDate":"2006-03-01","summary":"Quality analysis of database design. Trouble shooting and optimization of SQL scripts for data import/export and database maintenance. VBScript for SQL Server inventory using WMI.","higlights":null},{"name":"Sigtuna Council","position":"","website":"","startDate":"2005-10-01","endDate":"2006-03-01","summary":"Was the single developer on this Identity Management project that would become Microsoft's reference case for Microsoft Identity Integration Server (MIIS). Implemented management agents for the client's HR system, the directory services eDirectory and Active Directory. Implemented automatic creation of GroupWise accounts and Novell Server home directories. Wrote rules extensions for attribute flow and joins.\n","higlights":null},{"name":"Sveriges Television","position":"","website":"","startDate":"2005-07-01","endDate":"2005-07-31","summary":"Maintenance of the client's system inventory tool.","higlights":null},{"name":"Taxi Stockholm","position":"","website":"","startDate":"2005-05-01","endDate":"2005-07-01","summary":"Migration of Taxi Stockholm's intranet and external web site from Spirello to EpiServer. Integration with the client's Unix based booking system.\n","higlights":null},{"name":"Siemens Medical","position":"","website":"","startDate":"2000-01-01","endDate":"2001-01-01","summary":"QA and supporting colleges during development and maintenance of Siemens Medical's intranet \"EMPower\".","higlights":null},{"name":"Hewlett Packard Sweden","position":"","website":"","startDate":"1999-09-01","endDate":"2005-03-31","summary":"Requirements analysis, use case design, system design and development of a web based admininstration interface for information about and registrations for customer events for HP EMEA. Requirements analysis, design and development of a web based administration interface for HP's scandinavian products database.  Development of templates for the client's EpiServer based intranet. Maintenance and further development of www.hp.se.\n","higlights":null},{"name":"Looström & Gelin AB","position":"","website":"","startDate":"1998-10-01","endDate":"1999-07-31","summary":"Designed and developed a document management system based on Visual Basic 5. Assisted in developing the company web site.","higlights":null}]}